# **CHAPTER 10**
# **Data Aggregation and Group Operations**

## **10.1 GroupBy Mechanics**

In [4]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

In [5]:
df

  key1 key2     data1     data2
0    a  one -0.062534 -1.463911
1    a  two -0.581128 -0.664704
2    b  one -0.541747 -0.231510
3    b  two -1.561777 -1.127930
4    a  one -0.213114 -0.513492

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [7]:
 grouped

In [8]:
grouped.mean()

key1
a   -0.285592
b   -1.051762
Name: data1, dtype: float64

In [9]:
 means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -0.137824
      two    -0.581128
b     one    -0.541747
      two    -1.561777
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -0.137824 -0.581128
b    -0.541747 -1.561777

In [12]:
 states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [13]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [14]:
df['data1'].groupby([states, years]).mean()

California  2005   -0.581128
            2006   -0.541747
Ohio        2005   -0.812155
            2006   -0.213114
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.285592 -0.880702
b    -1.051762 -0.679720

In [16]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.137824 -0.988701
     two  -0.581128 -0.664704
b    one  -0.541747 -0.231510
     two  -1.561777 -1.127930

In [17]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

### **Iterating Over Groups**

In [18]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.062534 -1.463911
1    a  two -0.581128 -0.664704
4    a  one -0.213114 -0.513492
b
  key1 key2     data1    data2
2    b  one -0.541747 -0.23151
3    b  two -1.561777 -1.12793

In [19]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.062534 -1.463911
4    a  one -0.213114 -0.513492
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.581128 -0.664704
('b', 'one')
  key1 key2     data1    data2
2    b  one -0.541747 -0.23151
('b', 'two')
  key1 key2     data1    data2
3    b  two -1.561777 -1.12793

In [21]:
pieces = dict(list(df.groupby('key1')))

In [22]:
pieces['b']

  key1 key2     data1    data2
2    b  one -0.541747 -0.23151
3    b  two -1.561777 -1.12793

In [23]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [24]:
grouped = df.groupby(df.dtypes, axis=1)

In [25]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.062534 -1.463911
1 -0.581128 -0.664704
2 -0.541747 -0.231510
3 -1.561777 -1.127930
4 -0.213114 -0.513492
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### **Selecting a Column or Subset of Columns**